wegam/STM32F1xWorkSpace/Examples/HC/PL012V20.C
/******************** (C) COPYRIGHT 2008 STMicroelectronics ********************
* File Name          : PC001V21.c
* Author             : WOW
* Version            : V2.0.1
* Date               : 06/26/2017
* Description        : PC001V21层控制板.
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

#ifdef PL012V20				//拆零柜LCD板

#include "PL012V20.H"

//#include "R61509V.h"
//#include "ILI9326.h"

#include "CS5530.H"

#include "LCD.H"
#include "GT32L32M0180.H"
#include "STM32F10x_BitBand.H"
#include "STM32_GPIO.H"
#include "STM32_SYS.H"
#include "STM32_SYSTICK.H"
#include "STM32_WDG.H"
#include "STM32_PWM.H"
#include "STM32_USART.H"



#include "SWITCHID.H"
#include 	"TOOL.H"

#include "string.h"				//串和内存操作函数头文件
#include "stm32f10x_dma.h"

LCDDef	sLCD;


#define	font	16

u16	DelayTime=0x1000;
u16	LCDTime=0;
u16	DSPTime=0;
u32 testADC=0;
u32 bacADC=0;
u32 bacADC2=0;



u16 SumFed[8]={0};		//总共已发药数量
u16	SumFQ[8]={0};			//总共发药请求数量
u8	NumFW=0;		//待发药槽位
u8	Onlinede=0;		//待发药槽位


//t_Point point;
//u8 zimo[720]="R61509V_DrawRectangle(11,11,229,389,0X07FF)";

RS485Def  RS485;
u8 RS485FLG	=	0;
u32 RS485Time	=	0;
u32 RSRLen	=	0;

u8 TxdBuffe[256]={0};
u8 RxdBuffe[256]={0};
u8 RevBuffe[256]={0};
u16 RxNum=0;
char	Char_Buffer[256]={0xFF};		//记录format内码
//t_LcdCfg **pLcdpara;


SwitchDef	SWITCHID;
u8 SwitchID=0;	//拔码开关地址


u16 ATTime	=	0;
u8 ATNum	=	0;
u16	line	=	0;
u16	row	=	1;
u8 WriteFlag	=	0;
u8 PowerUP	=	0;

u8 	Serial	=	0;
u8 	Addr	=	0;
u16 Time	=	0;
u8 GetAdd	=	0;
u16 DspTime	=	0;
u16 color	=	0;

 u16 year; 
 u8 month;
 u8 day;
 u8 hour;
 u8 minute;
 u8 second;

unsigned char Version[]="PL012V2.0 RF智能耗材管理柜";


void GetTime(void);
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PL012V20_Configuration(void)
{
	SYS_Configuration();					//系统配置---打开系统时钟 STM32_SYS.H
	
	GPIO_DeInitAll();							//将所有的GPIO关闭----V20170605
	LCD_Configuration();
//	R61509V_Configuration();
//	ILI9326_Configuration();
	RS485_Configuration();
	
//	LCD_Printf(0		,0	,32	,0,"序号：");				//待发药槽位，后边的省略号就是可变参数
	
	SwitchID_Configuration();
//	SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS
	
//	IWDG_Configuration(1000);			//独立看门狗配置---参数单位ms	
	PWM_OUT(TIM2,PWM_OUTChannel1,2,900);	//PWM设定-20161127版本--指示灯
	PWM_OUT(TIM3,PWM_OUTChannel3,1000,500);		//PWM设定-20161127版本--背光
	
	GetTime();	
	
	LCD_ShowAntenna(380,0,3,LCD565_WHITE);   //显示12x12电池
	
	
	LCD_Printf(0,140,16,LCD565_RED,"显示驱动:%4X",LCD_ReadData(0x0000));		//编译日期
	LCD_Printf(0,0,32,LCD565_YELLOW,"项目编号:%s",Version);		//项目编号
//  LCD_Printf(0,220,16,LCD565_RED,"编译时间:%4d-%0.2d-%0.2d-%s",year,month,day,__TIME__); 	//编译时间
  LCD_Printf(0,220,16,LCD565_WHITE,"%0.2d:",hour);		//编译日期
  LCD_Printf(8*3,220,16,LCD565_WHITE,"%0.2d:",minute);		//编译日期
  LCD_Printf(8*6,220,16,LCD565_WHITE,"%0.2d",second);		//编译日期
	
//	ILI9326_SetBackground(LCD565_BLUE);
  LCD_Printf(0,100,16,LCD565_RED,"%s",Version);		//项目编号
  SysTick_Configuration(1000);	//系统嘀嗒时钟配置72MHz,单位为uS
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void GetTime(void)
{
	BuildTimeDef*	BuildTime	=	GetBuildTime(__DATE__,__TIME__);
	
  year  	= BuildTime->year;
  month 	= BuildTime->month;
  day   	= BuildTime->day;
  hour  	= BuildTime->hour;
  minute  = BuildTime->minute;
	
  second  = BuildTime->second;
}
/*******************************************************************************
* 函数名		:	
* 功能描述	:	 
* 输入		:	
* 输出		:
* 返回 		:
*******************************************************************************/
void PL012V20_Server(void)
{	
	
	IWDG_Feed();								//独立看门狗喂狗
//	Time++;
//  ClockServer();
	if(Time++>999)
	{
		Time	=	0;
    ClockServer();
	}

//	LCD_Fill(10,10,50,50,LCD565_WHITE);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	
//	LCD_ShowBattery(360,0,2,LCD565_RED);   //显示12x12电池
//	LCD_ShowBattery(380,0,3,LCD565_RED);   //显示12x12电池
//	LCD_Printf(0,180,32,LCD565_RED,"获取地址......");		//后边的省略号就是可变参数
//	LCD_Clean(LCD565_BLACK); 					//清除屏幕函数
	
//	LCD_Display();
//	return;
	PD014Test_Server();

//	RS485_Server();
	return;
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void ClockServer(void)
{
  if(++second>59)
  {    
    second  = 0;
    if(++minute>59)
    {  
      minute  = 0;
      if(++hour>=24)
      { 
        hour = 0;
      }
      LCD_Printf(0,220,16,LCD565_WHITE,"%0.2d",hour);		//编译日期      
    }
    LCD_Printf(8*3,220,16,LCD565_WHITE,"%0.2d",minute);		//编译日期    
  }
  LCD_Printf(8*6,220,16,LCD565_WHITE,"%0.2d",second);		//编译日期
}

/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void PD014Test_Server(void)
{
	u8 Num	=	0;
	
	
	Pd014AckFarmDef	RecAck;
	
	DspTime++;
	
//	PD014Test_GetAdd();
	
//	RS485_Server();
//	return;
	Num=RS485_ReadBufferIDLE(&RS485,RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(Num)
	{
		PD014Test_Display(RxdBuffe,Num);
//		if(0	==	GetAdd)
//		{
//			GetAdd	=	1;			
//			LCD_Printf(0,font*11,24,LCD565_RED,"获取到地址%0.2X",Addr);		//后边的省略号就是可变参数
//		}		
	}
	//=================================运行指示
	if(DspTime==500)
	{
		LCD_Fill(320,180,390,230,LCD565_RED);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		LCD_Fill(335,190,375,220,LCD565_GREEN);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		LCD_Fill(350,200,360,210,LCD565_MAGENTA);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	}
	else if(DspTime==1000)
	{
		DspTime	=	0;
		LCD_Fill(320,180,390,230,LCD565_YELLOW);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		LCD_Fill(335,190,375,220,LCD565_DARKBLUE);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
		LCD_Fill(350,200,360,210,LCD565_GRAY);				//在指定区域内填充指定颜色;区域大小:(xend-xsta)*(yend-ysta)
	}
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void PD014Test_GetAdd(void)
{
	Pd014Def	pInfo;
	if((50	==	Time++)&&(0	==	GetAdd))
	{
		Time	=	0;
		if(Addr++>0x03)
		{
			Addr	=	0;
			Serial+=1;
		}
			
		pInfo.Head			=	0x7E;
		pInfo.ADDdestin	=	Addr;
		pInfo.ADDsource	=	0x00;
		pInfo.Serial		=	Serial;
		pInfo.Cmd				=	0x01;
		pInfo.DataLen		=	0x00;
		pInfo.BCC8			=	BCC8(&pInfo.ADDdestin,5+pInfo.DataLen);
		pInfo.End				=	0x7F;
//		LCD_DrawLine(0,212,399,212,LCD565_RED);						//AB 两个坐标画一条直线
		LCD_Printf(0,font*9,24,LCD565_YELLOW,"获取地址%0.2X,流水号%2d......",Addr,Serial);		//后边的省略号就是可变参数
		RS485_DMASend(&RS485,(u8*)&pInfo,8+pInfo.DataLen);
		PowerUP	=	1;
	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void PD014Test_Display(u8* buffer,u8 RxNum)
{
	
	u16 temp	=	0;

	u16 PenColor	=LCD565_RED;
	if(0	!=	WriteFlag)
	{
		WriteFlag	=	0;
		PenColor	=LCD565_WHITE;
	}
	else
	{
		WriteFlag	=	1;
		PenColor	=LCD565_RED;
	}
	temp	=	font/2*3*RxNum;
	if(0<temp%400)
	{
		temp	=	(temp/400+1)*font;
	}
	else
	{
		temp	=	(temp/400)*font;
	}
	
	if(220-font*5<=temp+row)
	{
		LCD_Clean(LCD565_BLACK); 					//清除屏幕函数
		row	=	0;
//		LCD_Printf(0,font*9,24,LCD565_RED,"获取地址......");		//后边的省略号就是可变参数
	}
	
