wegam/STM32F1xWorkSpace/Examples/HC/PL012V20.C
	LCD_ShowHex(0,row,font,PenColor,RxNum,8,buffer);                //显示十六进制数据
	temp	=	font/2*3*RxNum;
	if(0<temp%400)
	{
		row	+=	(temp/400+1)*font;
	}
	else
	{
		row	+=	(temp/400)*font;
	}
//	if(row>=240-font)
//	{
//		row=0;
//	}
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void RS485_Server(void)
{
#if 1
//	if(ATTime++>1000)
//	{
//		ATTime=0;
//		if(ATNum++>4)
//			ATNum=0;
//		LCD_Clean(LCD565_BLACK); 					//清除屏幕函数
//	}
//	LCD_ShowAntenna(300,0,ATNum,200);   //显示12x12天线
	RxNum=RS485_ReadBufferIDLE(&RS485,RxdBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(RxNum)
	{
		u16 temp	=	0;
		u16 PenColor	=LCD565_RED;
		if(0	!=	WriteFlag)
		{
			WriteFlag	=	0;
			PenColor	=LCD565_WHITE;
		}
		else
		{
			WriteFlag	=	1;
			PenColor	=LCD565_GREEN;
		}
		temp	=	16*3*RxNum;
		if(0<temp%400)
		{
			temp	=	(temp/400+1)*32;
		}
		else
		{
			temp	=	(temp/400)*32;
		}
		if(240-32<=temp+row)
		{
			LCD_Clean(LCD565_BLACK); 					//清除屏幕函数
			row	=	0;
		}
		
		LCD_ShowHex(0,row,32,PenColor,RxNum,8,RxdBuffe);                //显示十六进制数据
		temp	=	16*3*RxNum;
		if(0<temp%400)
		{
			row	+=	(temp/400+1)*32;
		}
		else
		{
			row	+=	(temp/400)*32;
		}
		if(row>=240-32)
		{
			row=0;
//			LCD_Clean(LCD565_BLACK); 					//清除屏幕函数
		}
//		LCD_Show(0,100,32,RxNum,RxdBuffe);
//		PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
	}
	return;
#endif
#if 0
	RxNum=RS485_ReadBufferIDLE(&RS485,RevBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(RxNum	==	100)
	{
		RS485Time	=	0;
		PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
	}
	if(RS485Time++>=1000)
	{
		RS485Time	=	0;
		RS485_DMASend(&RS485,(u32*)TxdBuffe,100);	//RS485-DMA发送程序
		PWM_OUT(TIM3,PWM_OUTChannel3,500,1);		//PWM设定-20161127版本--背光
	}
#else
	RxNum=RS485_ReadBufferIDLE(&RS485,RevBuffe);	//串口空闲模式读串口接收缓冲区，如果有数据，将数据拷贝到RevBuffer,并返回接收到的数据个数，然后重新将接收缓冲区地址指向RxdBuffer
	if(RxNum)
	{
		RS485Time	=	0;
		RS485FLG	=	1;
		RSRLen	=	RxNum;
		RS485_DMASend(&RS485,RevBuffe,100);	//RS485-DMA发送程序
		PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
	}
	if(RS485FLG	==	1)
	{
		if(RS485Time++>=500)
		{
			RS485Time	=	0;
			RS485_DMASend(&RS485,RevBuffe,RSRLen);	//RS485-DMA发送程序
			RSRLen	=	0;
			RS485FLG	=	0;
			PWM_OUT(TIM3,PWM_OUTChannel3,500,800);		//PWM设定-20161127版本--背光
		}
	}
	
#endif
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void SwitchID_Configuration(void)
{
	SWITCHID.NumOfSW	=	8;
	
	SWITCHID.SW1_PORT	=	GPIOD;
	SWITCHID.SW1_Pin	=	GPIO_Pin_2;
	
	SWITCHID.SW2_PORT	=	GPIOA;
	SWITCHID.SW2_Pin	=	GPIO_Pin_15;
	
	SWITCHID.SW3_PORT	=	GPIOA;
	SWITCHID.SW3_Pin	=	GPIO_Pin_12;
	
	SWITCHID.SW4_PORT	=	GPIOA;
	SWITCHID.SW4_Pin	=	GPIO_Pin_11;
	
	SWITCHID.SW5_PORT	=	GPIOA;
	SWITCHID.SW5_Pin	=	GPIO_Pin_8;
	
	SWITCHID.SW6_PORT	=	GPIOB;
	SWITCHID.SW6_Pin	=	GPIO_Pin_15;
	
	SWITCHID.SW7_PORT	=	GPIOB;
	SWITCHID.SW7_Pin	=	GPIO_Pin_14;
	
	SWITCHID.SW8_PORT	=	GPIOB;
	SWITCHID.SW8_Pin	=	GPIO_Pin_13;
	
	SwitchIdInitialize(&SWITCHID);							//
	
//	SwitchID	=	SWITCHID_Read(&SWITCHID);		//
}
/*******************************************************************************
*函数名			:	function
*功能描述		:	function
*输入				: 
*返回值			:	无
*修改时间		:	无
*修改说明		:	无
*注释				:	wegam@sina.com
*******************************************************************************/
void SwitchID_Server(void)
{
	u8 temp=0;	//拔码开关临时地址
	temp	=	SWITCHID_Read(&SWITCHID);		//读取地址
	if(SwitchID	!=	temp)
	{
		u8 AddrH	=	0,AddrL	=	0;
		u32	w=0,n=0,d=0;
//	w	=	1;n	=	0;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
//	w	+=	1;n	+=	8;
//	PL010V13_PrintfString(n		,0	,16	,"%2d",w);				//待发药槽位，后边的省略号就是可变参数
		
		w	=	12345678;
		LCD_Printf(0		,0	,32	,0,"序号：");				//待发药槽位，后边的省略号就是可变参数
		LCD_Printf(0		,32	,32	,0,"拔码：");				//待发药槽位，后边的省略号就是可变参数
		LCD_Printf(96	,0	,32	,0,"%8d",w);				//待发药槽位，后边的省略号就是可变参数
		w	=	0;
		SwitchID	=	temp;
		for(n=0;n<8;n++)
		{
			if((temp&0x01)	==0x01)
			{
				d	=	1;
			}
			else
			{
				d	=	0;
			}
			temp>>=1;
			LCD_Printf(n*16+96		,32	,32	,0,"%d",d);				//待发药槽位，后边的省略号就是可变参数
		}
		AddrH	=	(SwitchID>>4)&0x0F;
		AddrL	=	(SwitchID>>0)&0x0F;
		LCD_Printf(0		,64	,32	,0,"层%0.2d，位%0.2d",AddrH,AddrL);				//待发药槽位，后边的省略号就是可变参数
	}
}



/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void LCD_Configuration(void)
{	
	//=======================LCD端口
	LCDPortDef	*LcdPort	=	&sLCD.Port;
	
	LcdPort->sCS_PORT	=	LcdCsPort;
	LcdPort->sCS_Pin	=	LcdCsPin;

	LcdPort->sDC_PORT	=	LcdDcPort;
	LcdPort->sDC_Pin	=	LcdDcPin;
	
	LcdPort->sWR_PORT	=	LcdWrPort;
	LcdPort->sWR_Pin	=	LcdWrPin;
	
	LcdPort->sRD_PORT	=	LcdRdPort;
	LcdPort->sRD_Pin	=	LcdRdPin;
	
	LcdPort->sREST_PORT	=	LcdRestPort;
	LcdPort->sREST_Pin	=	LcdRestPin;
	
	LcdPort->sBL_PORT		=	LcdBlPort;
	LcdPort->sBL_Pin		=	LcdBlPin;
	
	LcdPort->sTE_PORT		=	LcdTePort;
	LcdPort->sTE_Pin		=	LcdTePin;
	
	LcdPort->sDATABUS_PORT	=	LcdBusPort;
	LcdPort->sDATABUS_Pin		=	LcdBusPin;
	
